Public Member Functions | Protected Member Functions | Friends | List of all members
ACAPI::Element::OpeningGeometry Class Reference
Element Manager
#include <OpeningGeometry.hpp>
 Inheritance diagram for ACAPI::Element::OpeningGeometry:
 Public Member Functions
std::optional< Geometry::Polygon2D >  | GetPolygon () const
API_Coord3D  | GetAnchorPoint () const
API_Vector3D  | GetVectorX () const
API_Vector3D  | GetVectorY () const
API_Vector3D  | GetExtrusionDirection () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
OpeningGeometry (std::shared_ptr< Impl::OpeningGeometryImpl > impl)
Constructs an OpeningGeometry with an OpeningGeometry implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Friends
 class  | Opening
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
It represents the shape and place of the opening.
Since
Archicad 29
Constructor & Destructor Documentation
◆ OpeningGeometry()
 ACAPI::Element::OpeningGeometry::OpeningGeometry  |  ( |  std::shared_ptr< Impl::OpeningGeometryImpl > |  impl | )
protected
Constructs an OpeningGeometry with an OpeningGeometry implementation.
Parameters
impl | The OpeningGeometry implementation.
Member Function Documentation
◆ GetAnchorPoint()
 API_Coord3D ACAPI::Element::OpeningGeometry::GetAnchorPoint  |  ( |   | ) |   const
Returns
Returns the coordinates of the openings anchor point. This is the center of its local coordinate system.
◆ GetExtrusionDirection()
 API_Vector3D ACAPI::Element::OpeningGeometry::GetExtrusionDirection  |  ( |   | ) |   const
Returns
Returns the direction of the opening.
◆ GetPolygon()
 std::optional< Geometry::Polygon2D > ACAPI::Element::OpeningGeometry::GetPolygon  |  ( |   | ) |   const
Returns
Returns the polygon describing the openings shape. Returns nullopt if the opening does not use custom shape.
◆ GetVectorX()
 API_Vector3D ACAPI::Element::OpeningGeometry::GetVectorX  |  ( |   | ) |   const
Returns
Returns the base vector x of the openings local coordinate system.
◆ GetVectorY()
 API_Vector3D ACAPI::Element::OpeningGeometry::GetVectorY  |  ( |   | ) |   const
Returns
Returns the base vector y of the openings local coordinate system.